{
  "Books": [
    {
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/14348537-L.jpg",
      "price": 229,
      "genre": "Romance",
      "id": 1,
      "sypnosis": "In the rolling countryside of Regency England, Elizabeth Bennet, a sharp-witted young woman, lives with her four sisters and fretful mother, who is eager to secure them all advantageous marriages due to their modest circumstances. The arrival of the charming Mr. Bingley and his reserved friend Mr. Darcy at nearby Netherfield Park stirs the small community, setting off a flurry of balls, visits, and whispered speculations. Elizabeth finds herself at odds with Darcy’s aloof demeanor, sparking a lively clash of personalities that draws them into a web of misunderstandings and unspoken tensions. Alongside her family’s quirks—her father’s dry humor, her mother’s matchmaking zeal, and her sisters’ varied pursuits—the story unfolds with a cast of colorful figures like the pompous Mr. Collins and the dashing yet dubious Mr. Wickham, all navigating the delicate dance of love, pride, and social expectation in Austen’s witty exploration of human connection.",
      "pageCount": 448,
      "publishedDate": "1918"
    },
    {
      "title": "Alice's Adventures in Wonderland",
      "author": "Lewis Carroll",
      "cover": "https://covers.openlibrary.org/b/id/10527843-L.jpg",
      "price": 589,
      "genre": "Fantasy",
      "id": 2,
      "sypnosis": "On a lazy summer afternoon, curious Alice spots a White Rabbit in a waistcoat, hurrying along with a pocket watch and muttering about being late, prompting her to follow him down a peculiar rabbit hole. She tumbles into Wonderland, a strange and whimsical land where she encounters a host of eccentric characters: a grinning Cheshire Cat, a Mad Hatter hosting an endless tea party, and a hot-tempered Queen of Hearts fond of croquet and commands. As Alice navigates this topsy-turvy world—shrinking and growing with mysterious potions and cakes—she faces absurd situations, from debating a philosophical Caterpillar to joining a game with flamingos as mallets. Carroll’s fantastical tale brims with playful riddles and surreal encounters, inviting readers into a dreamlike realm where the rules of reality bend and a young girl’s curiosity leads her through a maze of wonder and oddity.",
      "pageCount": 102,
      "publishedDate": "2024-09-25"
    },
    {
      "title": "Wuthering Heights",
      "author": "Emily Brontë",
      "cover": "https://covers.openlibrary.org/b/id/12818862-L.jpg",
      "price": 451,
      "genre": "Gothic Fiction",
      "id": 3,
      "sypnosis": "Set against the wild, windswept moors of Yorkshire, this brooding tale begins as a curious traveler, Lockwood, rents Thrushcross Grange and learns of the nearby Wuthering Heights, a rugged estate steeped in mystery. There, he meets Heathcliff, a dark and intense man with a stormy past, and hears from the housekeeper Nelly Dean about his deep connection to Catherine Earnshaw, a spirited woman raised alongside him. Their bond, forged in childhood amidst the harsh beauty of the moors, is tested by societal divides and the arrival of the refined Linton family, stirring jealousy and unspoken longing. Brontë weaves a gothic atmosphere of raw emotion and eerie isolation, where the landscape mirrors the turbulent passions of its inhabitants, hinting at a saga of love and conflict that reverberates through the years.",
      "pageCount": 486,
      "publishedDate": "1870"
    },
    {
      "title": "A Christmas Carol",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13299222-L.jpg",
      "price": 353,
      "genre": "Classic Literature",
      "id": 4,
      "sypnosis": "In the bustling, foggy streets of Victorian London, Ebenezer Scrooge, a miserly old businessman, spends his days counting coins and shunning the cheer of Christmas, much to the dismay of his overworked clerk, Bob Cratchit, and his jovial nephew, Fred. On a chilling Christmas Eve, Scrooge is visited by the ghost of his long-dead partner, Jacob Marley, who appears bound in chains and warns of a spectral journey ahead. Three spirits—the nostalgic Ghost of Christmas Past, the hearty Ghost of Christmas Present, and the ominous Ghost of Christmas Yet to Come—soon arrive, each guiding Scrooge through visions of his life and the lives of those around him, from forgotten joys to present struggles. Dickens’ heartwarming story unfolds as a festive exploration of regret, compassion, and the chance for renewal, set against a backdrop of snowy streets and glowing hearths.",
      "pageCount": "220",
      "publishedDate": "2015-09-15"
    },
    {
      "title": "Adventures of Huckleberry Finn",
      "author": "Mark Twain",
      "cover": "https://covers.openlibrary.org/b/id/8157718-L.jpg",
      "price": 483,
      "genre": "Adventure",
      "id": 5,
      "sypnosis": "Along the muddy banks of the Mississippi River in the pre-Civil War South, Huckleberry Finn, a scrappy boy raised in a rough-and-tumble world, escapes his harsh father and sets out on a raft with Jim, a runaway slave with a gentle spirit. Their journey downstream introduces them to a colorful array of characters: smooth-talking con men, feuding families with rifles at the ready, and townsfolk caught up in their own quirks and prejudices. As Huck and Jim drift through lazy days and starry nights, they navigate the river’s bends and the challenges of a society divided by race and morality, forming a bond that tests Huck’s understanding of right and wrong. Twain’s lively narrative paints a vivid picture of adventure and human complexity, capturing the humor and heart of life along the water’s edge.",
      "pageCount": 48,
      "publishedDate": "2011-03-08"
    },
    {
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "cover": "https://covers.openlibrary.org/b/id/14314858-L.jpg",
      "price": 209,
      "genre": "Gothic Fiction",
      "id": 6,
      "sypnosis": "In the elegant drawing rooms of Victorian London, Dorian Gray, a young man of striking beauty, becomes the muse of painter Basil Hallward, who captures his likeness in a breathtaking portrait. Introduced to the witty and cynical Lord Henry Wotton, Dorian is swept into a world of hedonistic ideas, sparking a fascination with eternal youth and pleasure that alters his outlook. As he embarks on a life of indulgence, surrounded by the opulence of high society and the shadows of its underbelly, Dorian notices something strange about the portrait that now hangs in his home, hinting at a mysterious connection to his actions. Wilde’s gothic tale weaves a web of beauty, temptation, and introspection, exploring the allure of a life unbound by consequence against the backdrop of a morally rigid era.",
      "pageCount": 207,
      "publishedDate": "2024-08-27"
    },
    {
      "title": "Emma",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/9278312-L.jpg",
      "price": 159,
      "genre": "Romance",
      "id": 7,
      "sypnosis": "In the quaint village of Highbury, Emma Woodhouse, a clever and wealthy young woman, enjoys a life of comfort with her doting, hypochondriac father, free from the pressures of courtship that occupy others. Confident in her judgment, she takes up matchmaking, aiming to guide the romantic fates of friends like the impressionable Harriet Smith, while brushing off the gentle criticisms of her longtime friend, Mr. Knightley. Her plans soon entangle her with a cast of locals—the charming but enigmatic Frank Churchill, the pompous vicar Mr. Elton, and the ever-present gossip of Miss Bates—leading to a series of social missteps and unexpected rivalries. Austen’s lighthearted story unfolds with warmth and irony, painting a portrait of a spirited heroine learning the limits of her influence amid the quiet rhythms of country life.",
      "pageCount": 442,
      "publishedDate": "1886"
    },
    {
      "title": "Oliver Twist",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13300802-L.jpg",
      "price": 595,
      "genre": "Classic Literature",
      "id": 8,
      "sypnosis": "Born into the grim confines of a workhouse in Victorian England, Oliver Twist, a frail and orphaned boy, grows up under the stern watch of beadles and matrons who offer little kindness or sustenance. Escaping a life of labor and hunger, he makes his way to London, where the sprawling city’s dark alleys draw him into the clutches of Fagin, a crafty old man who oversees a band of young pickpockets, including the sly Artful Dodger. Amidst the bustle of markets and the haze of coal smoke, Oliver meets a mix of characters—some harsh, like the brutal Bill Sikes, and others kinder, like the compassionate Nancy—each shaping his path through a world of crime and hardship. Dickens’ tale paints a stark yet hopeful picture of a child’s resilience, set against the gritty backdrop of a society wrestling with poverty and compassion.",
      "pageCount": 582,
      "publishedDate": "2020-06-04"
    },
    {
      "title": "Frankenstein or The Modern Prometheus",
      "author": "Mary Shelley",
      "cover": "https://covers.openlibrary.org/b/id/12356249-L.jpg",
      "price": 334,
      "genre": "Gothic Fiction",
      "id": 9,
      "sypnosis": "In the shadowed halls of a university in Ingolstadt, Victor Frankenstein, a brilliant and ambitious student, becomes consumed by a daring quest to unlock the secrets of life itself, driven by a mix of scientific curiosity and personal tragedy. Working in isolation, he constructs a being from scavenged parts, bringing it to life in a moment of triumph that quickly turns to dread as he confronts the reality of his creation. The creature, towering and misunderstood, wanders into a world that shuns it, forcing Victor to grapple with the consequences of his actions as their paths begin to intertwine. Shelley’s haunting narrative unfolds across icy landscapes and quiet villages, weaving a tale of creation, responsibility, and the search for belonging in a gothic framework that lingers with unease.",
      "pageCount": 220,
      "publishedDate": "1846"
    },
    {
      "title": "A Tale of Two Cities",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13301713-L.jpg",
      "price": 323,
      "genre": "Historical Fiction",
      "id": 10,
      "sypnosis": "Set against the turbulent backdrop of the French Revolution, this sweeping story bridges the bustling streets of London and the restless chaos of Paris, where the lives of a diverse cast begin to converge. Dr. Alexandre Manette, a former prisoner of the Bastille, is reunited with his gentle daughter Lucie after years of confinement, while Charles Darnay, a Frenchman with a complicated heritage, seeks a new life across the Channel. Meanwhile, Sydney Carton, a disillusioned lawyer with a sharp mind dulled by drink, finds himself drawn to Lucie’s quiet strength, setting the stage for a tale of sacrifice and unrest. Dickens crafts a vivid world of cobblestone alleys, revolutionary fervor, and personal struggles, where the echoes of ‘liberty, equality, fraternity’ ripple through the lives of those caught in history’s storm.",
      "pageCount": 504,
      "publishedDate": "1902"
    },
    {
      "title": "The Hound of the Baskervilles",
      "author": "Arthur Conan Doyle",
      "cover": "https://covers.openlibrary.org/b/id/8063264-L.jpg",
      "price": 542,
      "genre": "Mystery",
      "id": 11,
      "sypnosis": "On the foggy, desolate moors of Dartmoor, Sherlock Holmes and his steadfast companion Dr. Watson are summoned to unravel a chilling mystery tied to the ancient Baskerville family. Sir Charles Baskerville has died under strange circumstances, leaving his heir, Sir Henry, to inherit a grand estate shadowed by tales of a spectral hound that haunts the lineage. As the pair arrives at Baskerville Hall, they encounter a cast of intriguing locals—the secretive Stapleton siblings, a nervous butler, and a rugged farmer—all set against a landscape of eerie mists and hidden dangers. Doyle’s tale blends suspense and intellect, with Holmes’ keen eye sifting through superstition and subtle clues to confront a puzzle that tests the boundaries of reason and legend.",
      "pageCount": 170,
      "publishedDate": "2006"
    },
    {
      "title": "The Adventures of Sherlock Holmes [12 stories]",
      "author": "Arthur Conan Doyle",
      "cover": "https://covers.openlibrary.org/b/id/6717853-L.jpg",
      "price": 226,
      "genre": "Mystery",
      "id": 12,
      "sypnosis": "From the gaslit rooms of 221B Baker Street, Sherlock Holmes, the master of deduction, and his loyal friend Dr. Watson tackle a dozen intriguing cases that illuminate the shadows of Victorian London. Clients arrive with tales of stolen jewels, mysterious societies, and perplexing disappearances, each presenting a challenge that Holmes meets with his trademark pipe, violin, and razor-sharp mind. Whether it’s a red-headed pawnbroker with a curious job offer or a governess fearing for her safety, the stories unfold with a mix of quirky characters—think cunning thieves, desperate heirs, and secretive lodgers—and the city’s foggy streets as a backdrop. Doyle’s collection captures the thrill of the chase and the quiet brilliance of observation, offering a window into a world where every detail holds a story waiting to be uncovered.",
      "pageCount": 392,
      "publishedDate": "2023-07-18"
    },
    {
      "title": "The Mysterious Affair at Styles",
      "author": "Agatha Christie",
      "cover": "https://covers.openlibrary.org/b/id/13699667-L.jpg",
      "price": 114,
      "genre": "Mystery",
      "id": 13,
      "sypnosis": "At Styles Court, a sprawling country manor in the English countryside, the sudden death of its wealthy matriarch, Emily Inglethorp, disrupts the household and draws the attention of Hercule Poirot, a meticulous Belgian detective with a flair for order. Captain Hastings, recovering from war wounds, narrates as Poirot arrives to investigate, greeted by a family full of secrets: a much-younger husband, a pair of stepsons with strained ties, and a lively young companion. The air buzzes with suspicion as Poirot examines locked rooms, cryptic notes, and the lingering scent of poison, his ‘little grey cells’ humming with curiosity. Christie’s debut introduces a classic whodunit, rich with misdirection and the quiet charm of a rural estate hiding more than it reveals.",
      "pageCount": 249,
      "publishedDate": "2022-06-11"
    },
    {
      "title": "The Secret Adversary",
      "author": "Agatha Christie",
      "cover": "https://covers.openlibrary.org/b/id/14590159-L.jpg",
      "price": 283,
      "genre": "Mystery",
      "id": 14,
      "sypnosis": "In the lively chaos of post-World War I London, Tommy Beresford and Tuppence Cowley, two spirited friends down on their luck, decide to form ‘The Young Adventurers, Ltd.,’ offering their wits for hire in a city buzzing with change. Their first job comes quickly: a search for a missing woman tied to a secret document lost when the Lusitania sank, pulling them into a shadowy game of intrigue. Pursued by a mysterious figure known only as ‘Mr. Brown,’ they dodge danger through bustling streets and quiet tea rooms, meeting a cast of allies and foes—from a nervous American to a sharp-witted heiress. Christie’s early thriller crackles with energy and light romance, setting the stage for a duo whose pluck and banter shine amid a web of secrets.",
      "pageCount": 387,
      "publishedDate": "2021-01-01"
    },
    {
      "title": "The mystery of Edwin Drood",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/8243336-L.jpg",
      "price": 243,
      "genre": "Mystery",
      "id": 15,
      "sypnosis": "In the sleepy cathedral town of Cloisterham, where ancient spires cast long shadows, Edwin Drood, a young man with a bright future, navigates life under the watchful eye of his uncle, John Jasper, a choirmaster with a secretive edge. The arrival of the spirited Neville and Helena Landless, twins from afar, stirs the town’s quiet rhythms, especially as tensions simmer around Edwin’s engagement to the delicate Rosa Bud. Jasper’s brooding presence and the town’s undercurrents of unease hint at hidden passions and dark intentions, while a newcomer, Dick Datchery, begins to poke into the community’s corners. Dickens’ unfinished work drapes a gothic veil over its mystery, leaving readers to ponder the fates unfolding in its misty, musical streets.",
      "pageCount": 271,
      "publishedDate": "2022-06-13"
    },
    {
      "title": "His Last Bow [8 stories]",
      "author": "Arthur Conan Doyle",
      "cover": "https://covers.openlibrary.org/b/id/8243267-L.jpg",
      "price": 148,
      "genre": "Mystery",
      "id": 16,
      "sypnosis": "Sherlock Holmes, the detective whose name echoes through London’s fog, returns in eight tales narrated by Dr. Watson, showcasing his later years of sleuthing from cozy studies to windswept coasts. Cases range from a diplomat’s strange lodger to a Cornish holiday shadowed by an eerie poison, each drawing Holmes and Watson into puzzles that test their wits against cunning foes and odd circumstances. With his pipe in hand and a glint in his eye, Holmes unravels mysteries involving coded messages, family secrets, and wartime shadows, joined by a cast of anxious clients and baffled police. Doyle’s collection blends the familiar thrill of deduction with a seasoned detective’s quiet resolve, set against a changing world that still needs his sharp mind.",
      "pageCount": 1336,
      "publishedDate": "1966"
    },
    {
      "title": "The Riddle of the Sands",
      "author": "Erskine Childers",
      "cover": "https://covers.openlibrary.org/b/id/2293974-L.jpg",
      "price": 322,
      "genre": "Adventure",
      "id": 17,
      "sypnosis": "Carruthers, a restless London clerk, accepts an impromptu sailing trip from his old friend Davies, expecting a break from routine, only to find himself aboard a small yacht threading the North Sea’s treacherous Frisian coast. Amid shifting sands and foggy channels, Davies shares a troubling suspicion: something ominous is afoot among the German islands, hinting at a larger scheme. The two navigate choppy waters and quiet harbors, encountering wary locals and a suave yachtsman named Dollmann, whose charm belies a guarded air. Childers’ tale unfolds with the salt-stung realism of a sailor’s life, blending adventure with a creeping sense of discovery as the duo sails into uncharted tensions.",
      "pageCount": 372,
      "publishedDate": "2020-12-25"
    },
    {
      "title": "The Man Who Was Thursday",
      "author": "Gilbert Keith Chesterton",
      "cover": "https://covers.openlibrary.org/b/id/8242857-L.jpg",
      "price": 495,
      "genre": "Mystery",
      "id": 18,
      "sypnosis": "Gabriel Syme, a poet with a penchant for order, steps into the shadowy underworld of London as a secret policeman, tasked with infiltrating a council of anarchists who name themselves after days of the week. Appointed ‘Thursday,’ he meets the group’s towering leader, ‘Sunday,’ a figure whose jovial menace sets Syme on edge, and a band of conspirators whose motives remain cloaked in mystery. As he moves through smoky pubs and bustling streets, Syme finds himself drawn into a chase that blurs the lines between chaos and purpose, surrounded by allies and enigmas alike. Chesterton’s tale spins a web of suspense and philosophical wonder, inviting readers into a surreal journey through a city alive with secrets.",
      "pageCount": 165,
      "publishedDate": "2015-04-28"
    },
    {
      "title": "Heart of Darkness",
      "author": "Joseph Conrad",
      "cover": "https://covers.openlibrary.org/b/id/12307847-L.jpg",
      "price": 338,
      "genre": "Adventure",
      "id": 19,
      "sypnosis": "Charles Marlow, a weathered mariner, recounts a journey up the winding Congo River, hired by a trading company to captain a steamboat into the heart of colonial Africa. As he steers through dense jungles and past crumbling outposts, he hears whispers of Kurtz, a trader whose brilliance and influence have taken on mythic proportions among the natives and company men alike. The river’s oppressive stillness and the stark realities of exploitation weigh on Marlow, drawing him deeper into a land where the boundaries of civilization fray. Conrad’s narrative, framed as a tale told on the Thames, unfolds with a haunting intensity, exploring the clash of ambition and the wild unknown.",
      "pageCount": 109,
      "publishedDate": "2023-11-21"
    },
    {
      "title": "Преступление и наказание",
      "author": "Фёдор Михайлович Достоевский",
      "cover": "https://covers.openlibrary.org/b/id/9411873-L.jpg",
      "price": 413,
      "genre": "Psychological Fiction",
      "id": 20,
      "sypnosis": "In the gritty, crowded streets of 1860s St. Petersburg, Rodion Raskolnikov, a former student now living in poverty, wrestles with a bold idea that consumes his thoughts, pushing him toward a drastic act against an unscrupulous pawnbroker. Haunted by his own reasoning and the city’s oppressive heat, he moves among a cast of vivid figures: his loyal sister Dunya, the struggling Marmeladov family, and Sonya, a young woman with a quiet strength born of hardship. A shrewd detective, Porfiry Petrovich, begins to take an interest in Raskolnikov’s restless demeanor, adding tension to his already fraught existence. Dostoevsky’s intense narrative delves into the mind’s shadows, painting a portrait of a man grappling with morality and consequence in a world of stark contrasts.",
      "pageCount": 574,
      "publishedDate": "1916"
    },
    {
      "title": "Frankenstein or The Modern Prometheus",
      "author": "Mary Shelley",
      "cover": "https://covers.openlibrary.org/b/id/12356249-L.jpg",
      "price": 325,
      "genre": "Gothic Fiction",
      "id": 21,
      "sypnosis": "Victor Frankenstein, a young scholar in Geneva, is driven by a relentless curiosity about the mysteries of life, leading him to a secluded laboratory where he embarks on a groundbreaking experiment. His creation—a towering figure born from science—emerges into a world unprepared for its presence, setting off a chain of events that weigh heavily on Victor’s conscience. As the creature roams through snowy mountains and quaint villages, it encounters a humanity that recoils from it, deepening the rift with its creator. Shelley’s gothic tale unfolds with a chilling beauty, tracing a path through icy wilderness and quiet towns, where questions of creation and belonging echo in the stillness.",
      "pageCount": 220,
      "publishedDate": "1846"
    },
    {
      "title": "Brave New World",
      "author": "Aldous Huxley",
      "cover": "https://covers.openlibrary.org/b/id/8231823-L.jpg",
      "price": 425,
      "genre": "Science Fiction",
      "id": 22,
      "sypnosis": "In a sleek, futuristic society where humans are engineered in laboratories and pacified by a drug called Soma, Bernard Marx, an outsider among his peers, chafes against the rigid order of this gleaming world. Life here is a blur of artificial pleasures and assigned roles, from the bustling cities to the sterile hatcheries that shape every citizen’s fate. When Bernard visits a Savage Reservation—a stark contrast of raw, unpolished life—he meets John, a man raised on old books and untamed emotions, whose arrival back in civilization stirs curiosity and unease. Huxley’s dystopian vision unfolds with a cold brilliance, sketching a landscape where technology and control promise harmony but hint at something vital left behind.",
      "pageCount": 205,
      "publishedDate": "1969"
    },
    {
      "title": "De rerum natura",
      "author": "Titus Lucretius Carus",
      "cover": "https://covers.openlibrary.org/b/id/566208-L.jpg",
      "price": 292,
      "genre": "Philosophy",
      "id": 23,
      "sypnosis": "In this ancient Roman poem, Lucretius sets out to explain the workings of the universe through the lens of Epicurean thought, weaving a tapestry of ideas that stretch from the stars to the smallest grains of matter. Writing in vivid Latin verse, he explores the nature of atoms, the vastness of the cosmos, and the fleeting beauty of life on earth, all while challenging the fears of gods and death that grip his fellow men. His words paint scenes of swirling dust, crashing waves, and the quiet cycles of seasons, offering a vision of a world governed by chance and reason rather than divine will. Lucretius’ work stands as a philosophical journey, inviting readers to find peace in understanding the natural order amidst the grandeur of existence.",
      "pageCount": "300",
      "publishedDate": "1631"
    },
    {
      "title": "Le Tour du Monde en Quatre-Vingts Jours",
      "author": "Jules Verne",
      "cover": "https://covers.openlibrary.org/b/id/6976035-L.jpg",
      "price": 251,
      "genre": "Adventure",
      "id": 24,
      "sypnosis": "In the orderly parlors of 1872 London, Phileas Fogg, a precise and unflappable gentleman, shocks his fellow club members by wagering a fortune that he can circle the globe in just 80 days, a feat unheard of in an age of steam and sail. With his lively French servant Passepartout at his side, Fogg sets off on a whirlwind journey, boarding trains, steamships, and even an elephant as they cross continents from Europe’s capitals to India’s jungles and America’s plains. Along the way, they encounter a host of characters—shrewd captains, curious locals, and a persistent detective named Fix—while battling delays and the marvels of a shrinking world. Verne’s tale bursts with the excitement of exploration, capturing the spirit of an era on the cusp of modernity through Fogg’s cool determination and the wonders of travel.",
      "pageCount": 398,
      "publishedDate": "2023-04-11"
    },
    {
      "title": "The Invisible Man",
      "author": "H. G. Wells",
      "cover": "https://covers.openlibrary.org/b/id/6419199-L.jpg",
      "price": 498,
      "genre": "Science Fiction",
      "id": 25,
      "sypnosis": "In the quiet village of Iping, a stranger arrives wrapped in bandages and dark glasses, taking a room at the inn and sparking whispers among the locals with his reclusive habits and sharp temper. This is Griffin, a scientist who has unlocked the secret of invisibility, a discovery that promises power but comes with unforeseen burdens. As he settles into his makeshift laboratory, filled with glass vials and strange equipment, his presence unsettles the community, from the nosy vicar to the grumbling innkeeper. Wells’ story unfolds in a sleepy English setting, where the marvel of science meets the weight of isolation, hinting at a man caught between genius and the shadows of his own making.",
      "pageCount": 310,
      "publishedDate": "1897"
    },
    {
      "title": "Houghton Mifflin Science California",
      "author": "Houghton Mifflin Company Staff",
      "cover": "https://covers.openlibrary.org/b/id/12746894-L.jpg",
      "price": 545,
      "genre": "Educational",
      "id": 26,
      "sypnosis": "Designed for California’s young learners, this vibrant science textbook opens a window onto the natural world, tailored to the state’s diverse landscapes and rigorous standards. Its pages burst with colorful diagrams and photos, guiding students through topics like the shifting plates beneath the Sierras, the ecosystems of coastal tide pools, and the chemistry of everyday wonders like baking bread. Written by a team of educators, it invites exploration with hands-on ideas—think building a model volcano or tracking the stars—while weaving in stories of local science, from redwood forests to desert sands. This book aims to spark curiosity and understanding, offering a journey through knowledge that mirrors the Golden State’s rich tapestry of discovery.",
      "pageCount": 828,
      "publishedDate": "1921"
    },
    {
      "title": "History",
      "author": "Herodotus",
      "cover": "https://covers.openlibrary.org/b/id/9829028-L.jpg",
      "price": 588,
      "genre": "History",
      "id": 27,
      "sypnosis": "Herodotus, a Greek traveler with an insatiable curiosity, pens a sweeping account of the ancient world, focusing on the clash between Greece and Persia in the 5th century BCE, a work that earns him the title ‘Father of History.’ Across nine books, he roams from the marble cities of Athens to the golden sands of Egypt, recounting tales of kings like Croesus of Lydia and warriors like Leonidas of Sparta, alongside marvels like the Nile’s crocodiles and Babylon’s towering walls. His narrative blends battle reports with cultural sketches—Persian customs, Scythian rituals—gathered from merchants, priests, and his own wide-eyed wanderings. Written with a storyteller’s flair, it offers a vivid mosaic of a world in flux, where empires rise and heroes stand against the tide.",
      "pageCount": 380,
      "publishedDate": "2002-12-05"
    },
    {
      "title": "The Island of Dr. Moreau",
      "author": "H. G. Wells",
      "cover": "https://covers.openlibrary.org/b/id/968312-L.jpg",
      "price": 408,
      "genre": "Science Fiction",
      "id": 28,
      "sypnosis": "Edward Prendick, a shipwrecked Englishman, washes onto a remote Pacific island, greeted by Montgomery, a nervous assistant, and Dr. Moreau, a scientist with a commanding presence and a hidden purpose. The island hums with strange noises—growls and cries from creatures that defy nature—hinting at Moreau’s unsettling experiments in a makeshift laboratory tucked among the palms. Prendick soon meets the island’s inhabitants, a peculiar group marked by animal-like traits, their uneasy obedience enforced by a cryptic set of rules chanted in eerie unison. Wells’ tale casts a shadowy spell, blending the thrill of discovery with a creeping dread, as Prendick navigates a world where science blurs the line between man and beast.",
      "pageCount": 153,
      "publishedDate": "2015-10-02"
    },
    {
      "title": "Houghton Mifflin Science Leveled Readers",
      "author": "Houghton Mifflin Company Staff",
      "cover": "https://covers.openlibrary.org/b/id/12917356-L.jpg",
      "price": 428,
      "genre": "Educational",
      "id": 29,
      "sypnosis": "This series of slim science readers, crafted for young students, offers a ladder of learning with texts tailored to different reading levels, each brimming with the wonders of the world around us. Early books might explore the life of a tadpole with simple words and bright pictures, while later ones dive into the mysteries of volcanoes or the pull of gravity, complete with charts and fun facts. Created by educators, they blend clear explanations with engaging questions—‘Why do leaves change color?’ or ‘What keeps the moon in place?’—inviting kids to ponder and explore. With a focus on building knowledge step-by-step, these readers bring science to life for classrooms and curious minds alike.",
      "pageCount": 52,
      "publishedDate": "1945"
    },
    {
      "title": "[William Wheeler Hubbell, authorized to apply for patents.]",
      "author": "United States. Congress. Senate. Committee on Patents",
      "cover": "https://covers.openlibrary.org/b/id/10200621-L.jpg",
      "price": 508,
      "genre": "Legal",
      "id": 30,
      "sypnosis": "This formal document emerges from the halls of the U.S. Senate, where the Committee on Patents deliberates over William Wheeler Hubbell, an inventor seeking official recognition for his creations in a burgeoning industrial age. Likely tied to his work on machinery or weaponry—perhaps an innovative gear or a wartime tool—it captures a moment of legislative process, with senators weighing evidence and arguments in staid, official prose. The text outlines Hubbell’s case, hinting at the stakes of innovation in a nation racing toward progress, surrounded by the hum of factories and the promise of new ideas. A snapshot of 19th-century bureaucracy, it reflects the quiet drama of invention meeting law, preserved for posterity in ink and parchment.",
      "pageCount": 40,
      "publishedDate": "1938"
    },
    {
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/14348537-L.jpg",
      "price": 522,
      "genre": "Romance",
      "id": 31,
      "sypnosis": "Elizabeth Bennet, a lively and perceptive young woman, resides in a modest country home with her parents and four sisters, where the chatter of marriage prospects fills the air, driven by her mother’s anxious hopes for their future. The arrival of Mr. Bingley, a warm and wealthy bachelor, and his enigmatic friend Mr. Darcy at Netherfield Park sets the neighborhood abuzz with dances and dinners, drawing Elizabeth into a spirited rivalry with Darcy’s cool reserve. Amidst her family’s antics—her father’s sly wit, her sisters’ flirtations, and the meddling of relatives like Mr. Collins—she navigates a world of suitors and social graces, including the charming soldier Wickham. Austen’s tale sparkles with humor and heart, tracing the delicate threads of attraction and misunderstanding in a rural England alive with possibility.",
      "pageCount": 448,
      "publishedDate": "1918"
    },
    {
      "title": "Alice's Adventures in Wonderland",
      "author": "Lewis Carroll",
      "cover": "https://covers.openlibrary.org/b/id/10527843-L.jpg",
      "price": 312,
      "genre": "Fantasy",
      "id": 32,
      "sypnosis": "Alice, a bright and inquisitive girl, sits by a riverbank when a White Rabbit in a hurry dashes past, pulling her into a fantastical descent down a rabbit hole to Wonderland. There, she meets a gallery of oddballs—a Caterpillar puffing smoke, a Hatter lost in tea-time chatter, and a Queen whose temper flares over croquet and cards—all set in a land where sizes shift with a sip or a bite. Her journey weaves through gardens, halls, and wooded paths, each turn bringing a fresh riddle or a burst of nonsense that challenges her sense of the everyday. Carroll’s enchanting story unfolds like a dream, blending the strange with the familiar to capture the boundless imagination of youth.",
      "pageCount": 102,
      "publishedDate": "2024-09-25"
    },
    {
      "title": "Bible",
      "author": "Bible",
      "cover": "https://covers.openlibrary.org/b/id/12707846-L.jpg",
      "price": 594,
      "genre": "Religious",
      "id": 33,
      "sypnosis": "This vast collection of sacred writings, spanning the Old and New Testaments, offers a tapestry of stories, laws, and teachings that have shaped faith for millennia, penned by many hands across centuries. The Old Testament opens with the creation of the world, follows the trials of figures like Abraham and Moses through deserts and promised lands, and sings through the poetry of psalms and the warnings of prophets. The New Testament shifts to the dusty roads of Judea, where Jesus of Nazareth gathers followers with parables and acts of compassion, joined by disciples like Peter and Mary Magdalene. A cornerstone of spiritual life, it weaves history and hope into a narrative that resonates across time and cultures.",
      "pageCount": "1500",
      "publishedDate": "1992"
    },

    {
      "title": "Adventures of Huckleberry Finn",
      "author": "Mark Twain",
      "cover": "https://covers.openlibrary.org/b/id/8157718-L.jpg",
      "price": 547,
      "genre": "Adventure",
      "id": 35,
      "sypnosis": "Huckleberry Finn, a free-spirited boy from a sleepy Missouri town, takes to the wide Mississippi River on a raft, fleeing a life of rules and roughness with his new companion, Jim, a man seeking something beyond the chains of slavery. Their voyage drifts through sunlit days and moonlit nights, bringing them face-to-face with a parade of river folk—scheming tricksters, proud planters, and wary travelers—all shaped by the South’s tangled ways. As Huck steers their fragile craft, he wrestles with the lessons of his upbringing and the pull of a friendship that defies the world around them. Twain’s rollicking story flows with humor and grit, charting a course through a land of beauty and division.",
      "pageCount": 48,
      "publishedDate": "2011-03-08"
    },
    {
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "cover": "https://covers.openlibrary.org/b/id/14314858-L.jpg",
      "price": 518,
      "genre": "Gothic Fiction",
      "id": 36,
      "sypnosis": "Dorian Gray, a youthful beauty in Victorian London, captivates the artist Basil Hallward, who pours his soul into a portrait that glows with life, while the worldly Lord Henry Wotton whispers ideas of pleasure and youth into Dorian’s ear. Drawn into the glittering salons and dim theaters of the city, Dorian begins to chase a life of sensation, surrounded by admirers and the trappings of wealth, yet tethered to the painting that holds a secret he can’t ignore. As he moves through a society of strict codes and hidden vices, the contrast between his outward charm and inner choices begins to cast a shadow. Wilde’s gothic narrative glimmers with wit and unease, sketching a young man’s journey into a world where beauty and truth pull in opposite directions.",
      "pageCount": 207,
      "publishedDate": "2024-08-27"
    },
    {
      "title": "Oliver Twist",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13300802-L.jpg",
      "price": 171,
      "genre": "Classic Literature",
      "id": 37,
      "sypnosis": "Oliver Twist, a small boy born in a bleak workhouse, faces a childhood of scant meals and stern masters in an England shadowed by industrial grime, until he dares to seek a better life beyond its walls. Arriving in London’s teeming streets, he’s swept into the orbit of Fagin, a sly figure who rules over a ragtag crew of young thieves, including the quick-witted Artful Dodger. Amid the city’s smoky haze, Oliver crosses paths with rough characters like Bill Sikes and softer souls like Nancy, each leaving a mark on his innocent spirit as he stumbles through a maze of danger and kindness. Dickens’ story shines a light on a boy caught in the gears of a harsh world, rich with the clamor of survival and the flicker of hope.",
      "pageCount": 582,
      "publishedDate": "2020-06-04"
    },
    {
      "title": "Frankenstein or The Modern Prometheus",
      "author": "Mary Shelley",
      "cover": "https://covers.openlibrary.org/b/id/12356249-L.jpg",
      "price": 109,
      "genre": "Gothic Fiction",
      "id": 38,
      "sypnosis": "Victor Frankenstein, a driven young man from Geneva, delves into the forbidden edges of science, fueled by a longing to master the forces of life in the quiet of his study. His efforts give rise to a creature unlike any other, a being whose existence challenges the boundaries of nature and sets Victor on a path of doubt and discovery. As the creature ventures into the snowy Alps and sleepy hamlets, it meets a world that fears its difference, drawing Victor into a deepening tangle of duty and dread. Shelley’s gothic vision unfolds across stark landscapes, whispering of ambition, isolation, and the fragile line between creator and creation.",
      "pageCount": 220,
      "publishedDate": "1846"
    },
    {
      "title": "A Tale of Two Cities",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13301713-L.jpg",
      "price": 543,
      "genre": "Historical Fiction",
      "id": 39,
      "sypnosis": "In the shadow of the French Revolution, the lives of London and Paris intertwine through Dr. Manette, a physician freed from years of unjust captivity, and his devoted daughter Lucie, who builds a new home in England. Charles Darnay, a man with ties to France’s troubled past, and Sydney Carton, a wayward lawyer with a keen mind, enter their orbit, each shaped by the era’s unrest and personal choices. As the streets of Paris hum with revolutionary cries and London offers a quieter refuge, the characters navigate a world of loyalty, longing, and the echoes of change. Dickens’ tale sweeps through history’s tumult, blending the personal with the political in a vivid canvas of two cities poised on the edge.",
      "pageCount": 504,
      "publishedDate": "1902"
    },
    {
      "title": "The Wonderful Wizard of Oz",
      "author": "L. Frank Baum",
      "cover": "https://covers.openlibrary.org/b/id/552443-L.jpg",
      "price": 481,
      "genre": "Fantasy",
      "id": 40,
      "sypnosis": "Dorothy Gale, a young girl from the gray plains of Kansas, finds herself whisked away by a cyclone to the dazzling land of Oz, a place of emerald cities and talking creatures far from her simple farm life. With her little dog Toto, she sets out along the Yellow Brick Road to find the Wizard who might send her home, joined by a Scarecrow seeking wisdom, a Tin Woodman craving emotion, and a Lion in search of bravery. Their path winds through enchanted forests and past shimmering fields, meeting helpers and hindrances like the tiny Munchkins and a crafty witch with a broomstick. Baum’s whimsical adventure sparkles with color and heart, inviting readers into a world where courage and friendship light the way.",
      "pageCount": 312,
      "publishedDate": "2010-07-01"
    },
    {
      "title": "Gulliver's Travels",
      "author": "Jonathan Swift",
      "cover": "https://covers.openlibrary.org/b/id/12717083-L.jpg",
      "price": 374,
      "genre": "Satire",
      "id": 41,
      "sypnosis": "Lemuel Gulliver, a curious surgeon with a taste for the sea, sets sail on voyages that lead him to extraordinary lands, each stranger than the last, chronicling his tales with a sailor’s keen eye. He washes up in Lilliput, where tiny folk bustle with grand schemes, then towers over Brobdingnag’s gentle giants, who marvel at his smallness and odd ways. Later journeys bring him to Laputa, a floating isle of distracted scholars, and the realm of the Houyhnhnms, noble horses who rule over crude human-like creatures called Yahoos. Swift’s sharp-witted narrative unfolds with humor and bite, painting a world of odd societies that reflect the quirks and follies of our own.",
      "pageCount": 204,
      "publishedDate": "2011-08-01"
    },
    {
      "title": "Ἰλιάς",
      "author": "Όμηρος",
      "cover": "https://covers.openlibrary.org/b/id/7083790-L.jpg",
      "price": 419,
      "genre": "Epic Poetry",
      "id": 42,
      "sypnosis": "In the sun-scorched plains before the walls of Troy, Homer’s ancient epic unfolds during a long war sparked by a stolen queen, drawing warriors like the fierce Achilles and the noble Hector into its fray. The Greeks, camped by their black ships, clash with Trojans under the gaze of meddling gods—Zeus thundering from above, Athena whispering strategies—each side driven by honor and wrath. Leaders like Agamemnon and Priam steer their men through battles and councils, while the poet sings of bronze spears, dusty fields, and the weight of glory. This timeless tale pulses with the rhythm of heroism and fate, echoing across centuries from a world of myth and might.",
      "pageCount": 676,
      "publishedDate": "1504"
    },
    {
      "title": "The Adventures of Tom Sawyer",
      "author": "Mark Twain",
      "cover": "https://covers.openlibrary.org/b/id/12043351-L.jpg",
      "price": 401,
      "genre": "Adventure",
      "id": 43,
      "sypnosis": "Tom Sawyer, a mischievous boy in a sleepy Missouri town along the Mississippi, fills his days with pranks and daydreams, dodging chores and school with a grin and a quick excuse. Joined by his pal Huck Finn, a barefoot wanderer, and his sweetheart Becky Thatcher, he roams the riverbanks and wooded hills, chasing pirate games and hidden treasures. Their small world buzzes with quirky townsfolk—a stern aunt, a pompous schoolmaster, and shadowy figures lurking in the night—setting the stage for escapades that blend fun with a hint of danger. Twain’s tale captures the wild spirit of boyhood, rolling out a canvas of sunlit summers and riverside secrets.",
      "pageCount": 330,
      "publishedDate": "1920"
    },
    {
      "title": "The Prisoner of Zenda",
      "author": "Anthony Hope",
      "cover": "https://covers.openlibrary.org/b/id/105814-L.jpg",
      "price": 387,
      "genre": "Adventure",
      "id": 44,
      "sypnosis": "Rudolf Rassendyll, an idle Englishman with a taste for travel, journeys to the fictional kingdom of Ruritania, where his striking resemblance to the royal heir thrusts him into a whirlwind of intrigue. The king-to-be, a man of jovial charm, faces a coronation shadowed by plots from his scheming brother and a dashing rival, Rupert of Hentzau, stirring the castle’s ancient halls with tension. Rassendyll steps into a role he never sought, surrounded by loyal guards, a wise colonel, and the poised Princess Flavia, whose grace complicates his mission. Hope’s swashbuckling tale unfolds with cloaks, swords, and a kingdom’s fate hanging in the balance, rich with romance and daring.",
      "pageCount": 202,
      "publishedDate": "1897"
    },
    {
      "title": "The Scarlet Pimpernel",
      "author": "Emmuska Orczy, Baroness Orczy",
      "cover": "https://covers.openlibrary.org/b/id/479102-L.jpg",
      "price": 478,
      "genre": "Historical Fiction",
      "id": 45,
      "sypnosis": "In the blood-soaked chaos of the French Revolution, a mysterious figure known as the Scarlet Pimpernel emerges, spiriting aristocrats away from the guillotine’s blade with cunning and flair, leaving only a flower as his mark. Sir Percy Blakeney, a foppish English nobleman, hides his daring beneath a mask of laziness, bewildering his elegant wife Marguerite and the vengeful agent Chauvelin, who hunts the elusive hero. Across Channel crossings and Paris streets, the tale weaves through disguises, coded notes, and whispered plans, pitting wit against zeal in a time of terror. Orczy’s adventure glows with heroism and intrigue, set against a backdrop of revolutionary cries and quiet courage.",
      "pageCount": 273,
      "publishedDate": "2018"
    },
    {
      "title": "The Coral Island",
      "author": "Robert Michael Ballantyne",
      "cover": "https://covers.openlibrary.org/b/id/8242206-L.jpg",
      "price": 308,
      "genre": "Adventure",
      "id": 46,
      "sypnosis": "Three boys—Ralph, Jack, and Peterkin—find themselves stranded on a lush Pacific island after a shipwreck, their ship swallowed by a storm, leaving them to fend for themselves amid coral reefs and swaying palms. With the sea’s bounty and the island’s wonders—coconuts, fish, and hidden caves—they build a life of exploration, facing the sun and surf with youthful zeal. Their days are filled with makeshift shelters, fishing trips, and encounters with the wild, from colorful birds to the distant rumble of visitors who hint at a world beyond their shores. Ballantyne’s tale unfurls with the thrill of survival and the glow of friendship, a Victorian ode to adventure in an untamed paradise.",
      "pageCount": 358,
      "publishedDate": "2023-05-03"
    },
    {
      "title": "Around The World In Eighty Days",
      "author": "Jules Verne",
      "cover": "https://covers.openlibrary.org/b/id/6573517-L.jpg",
      "price": 108,
      "genre": "Science Fiction",
      "id": 47,
      "sypnosis": "Professor Pierre Aronnax, a French marine scholar, sets sail to investigate a mysterious ‘narwhal’ plaguing the seas, joined by his steadfast servant Conseil and the rugged harpooner Ned Land, only to find themselves aboard the Nautilus, a marvel of a submarine. Its commander, the enigmatic Captain Nemo, reveals a world beneath the waves, from coral gardens to sunken wrecks, all seen through the vessel’s glass ports as they glide through ocean depths. Aronnax marvels at the science and secrecy of Nemo’s domain, while Ned chafes at their confinement, their journey weaving through currents and wonders that defy the surface world. Verne’s vision dives into a realm of discovery and tension, blending awe with the pull of freedom.",
      "pageCount": "220",
      "publishedDate": "1965"
    },
    {
      "title": "Le petit prince",
      "author": "Antoine de Saint-Exupéry",
      "cover": "https://covers.openlibrary.org/b/id/10708272-L.jpg",
      "price": 406,
      "genre": "Fantasy",
      "id": 48,
      "sypnosis": "A pilot, stranded in the vast Sahara after a crash, meets a small boy with golden hair—the Little Prince—who hails from a tiny asteroid adorned with a rose and three volcanoes. Through their desert talks, the Prince shares tales of his travels across planets, meeting a king with no subjects, a businessman counting stars, and a lamplighter in endless dusk, each stop a brush with grown-up folly. His gentle voice and curious eyes weave a story of care and wonder, set against the sands and the stars that light their unlikely meeting. Saint-Exupéry’s tender fable glows with whimsy and wisdom, a quiet reflection on what matters most.",
      "pageCount": 108,
      "publishedDate": "2024-04-03"
    },
    {
      "title": "Kidnapped",
      "author": "Robert Louis Stevenson",
      "cover": "https://covers.openlibrary.org/b/id/8267822-L.jpg",
      "price": 205,
      "genre": "Adventure",
      "id": 49,
      "sypnosis": "David Balfour, a young Scot orphaned in the 18th century, seeks his inheritance only to be betrayed by a scheming uncle who sends him aboard a ship bound for distant shores, far from his lowland home. Fate intervenes when he meets Alan Breck Stewart, a bold Highlander with a flair for the sword and a heart tied to the Jacobite cause, sparking an alliance amid the ship’s creaking timbers. Their path takes them across rugged moors and misty glens, dodging soldiers and braving the wild, with David caught between loyalty and the pull of his own destiny. Stevenson’s tale races with the pulse of adventure, steeped in the lore of a Scotland torn by strife.",
      "pageCount": 356,
      "publishedDate": "1886"
    },
    {
      "title": "Harry Potter and the Philosopher's Stone",
      "author": "J. K. Rowling",
      "cover": "https://covers.openlibrary.org/b/id/10521270-L.jpg",
      "price": 353,
      "genre": "Fantasy",
      "id": 50,
      "sypnosis": "Harry Potter, an orphaned boy raised in a cramped cupboard by his cold aunt and uncle, discovers on his eleventh birthday that he’s a wizard, whisked away from suburban gloom to the hidden halls of Hogwarts School of Witchcraft and Wizardry. There, amid moving staircases and talking portraits, he finds friends in Ron Weasley, a cheerful redhead, and Hermione Granger, a brilliant bookworm, while learning spells and the art of broomstick flight. A mystery brews around a guarded secret within the castle, pulling Harry into a world of magic and whispers tied to his own past. Rowling’s enchanting debut opens a door to a realm of wonder, where a boy’s journey begins with a spark of possibility.",
      "pageCount": 24,
      "publishedDate": "2002-03"
    },
    {
      "title": "Wuthering Heights",
      "author": "Emily Brontë",
      "cover": "https://covers.openlibrary.org/b/id/12818862-L.jpg",
      "price": 150,
      "genre": "Gothic Fiction",
      "id": 51,
      "sypnosis": "On the stark Yorkshire moors, Wuthering Heights stands as a weathered sentinel, home to Heathcliff, a man of fierce demeanor, whose tale is unraveled by Nelly Dean to a visitor seeking shelter. She recalls his arrival as a ragged boy, taken in by the Earnshaws, where he forms a wild bond with Catherine, a girl as untamed as the windswept hills around them. Their closeness stirs unease with the arrival of the Lintons, a genteel family from Thrushcross Grange, setting off a clash of worlds and hearts beneath the moorland sky. Brontë’s gothic story brews with passion and shadow, a haunting glimpse into lives shaped by the land and its secrets.",
      "pageCount": 486,
      "publishedDate": "1870"
    },
    {
      "title": "Emma",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/9278312-L.jpg",
      "price": 592,
      "genre": "Romance",
      "id": 52,
      "sypnosis": "Emma Woodhouse, a bright and self-assured young woman, reigns over her small Highbury world, doting on her fretful father and delighting in the art of matchmaking among her neighbors. With her friend Harriet Smith—a sweet but naive girl—in tow, she meddles in matters of the heart, brushing off the steady counsel of Mr. Knightley, a family friend with a sharp eye and a kind word. The village hums with characters like the talkative Miss Bates, the elusive Frank Churchill, and the haughty Jane Fairfax, each adding to the swirl of dinners and dances that test Emma’s plans. Austen’s gentle comedy unfolds with charm, sketching a young woman’s dance with influence and affection in a cozy corner of England.",
      "pageCount": 442,
      "publishedDate": "1886"
    },
    {
      "title": "Sense and Sensibility",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/9278292-L.jpg",
      "price": 261,
      "genre": "Romance",
      "id": 53,
      "sypnosis": "Elinor and Marianne Dashwood, two sisters with hearts as different as their minds, face a quiet upheaval when their father’s death leaves them and their mother in modest means, uprooted to a cottage in Devonshire. Elinor, calm and practical, hides her feelings beneath a steady gaze, while Marianne, all passion and poetry, wears her emotions openly, drawing the eye of the dashing Willoughby and the reserved Colonel Brandon. Amidst country lanes and genteel visits, they navigate a world of suitors and secrets, joined by their lively sister Margaret and a host of neighbors who gossip and scheme. Austen’s tender tale weaves a delicate balance of reason and romance, set in a time of soft manners and hidden hopes.",
      "pageCount": 356,
      "publishedDate": "1864"
    },
    {
      "title": "Little Women",
      "author": "Louisa May Alcott",
      "cover": "https://covers.openlibrary.org/b/id/8775559-L.jpg",
      "price": 504,
      "genre": "Classic Literature",
      "id": 54,
      "sypnosis": "In a cozy New England home during the Civil War, the four March sisters—Meg, Jo, Beth, and Amy—share a life of modest means with their wise mother, Marmee, while their father serves far away as a chaplain. Meg dreams of elegance, Jo scribbles stories, Beth plays the piano with a shy smile, and Amy sketches her ambitions, each finding joy in small things amidst threadbare dresses and cold winters. Their days unfold with neighbor Laurie, a spirited boy who joins their plays and picnics, and a cast of kin who shape their world, from a gruff aunt to a kindly tutor. Alcott’s warm story glows with the trials and triumphs of girlhood, a timeless portrait of family and growth.",
      "pageCount": 35,
      "publishedDate": "2006"
    },
    {
      "title": "Northanger Abbey",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/12567961-L.jpg",
      "price": 342,
      "genre": "Romance",
      "id": 55,
      "sypnosis": "Catherine Morland, a dreamy girl with a love for gothic novels, leaves her quiet village for the lively spa town of Bath, where balls and new faces promise adventure beyond her simple upbringing. There, she meets the witty Henry Tilney and his warm sister Eleanor, alongside the boisterous Isabella Thorpe and her brother John, who pull her into a whirl of flirtations and friendships. An invitation to Northanger Abbey, the Tilneys’ ancestral home, stirs her imagination with visions of dark secrets, though the reality offers a gentler charm. Austen’s playful tale dances with satire and sweetness, tracing a young woman’s steps into a world of romance and reality.",
      "pageCount": 212,
      "publishedDate": "1993"
    },
    {
      "title": "Ethan Frome",
      "author": "Edith Wharton",
      "cover": "https://covers.openlibrary.org/b/id/8303480-L.jpg",
      "price": 389,
      "genre": "Tragedy",
      "id": 56,
      "sypnosis": "In the frozen hills of rural New England, Ethan Frome, a quiet farmer, toils on a stark homestead, bound to his ailing wife Zeena in a marriage drained of warmth, their days marked by silence and snow. The arrival of Mattie Silver, Zeena’s bright-eyed cousin, brings a flicker of life to the house, her laughter and energy a stark contrast to the bleak winter landscape. Ethan finds himself drawn to her, caught between duty and a yearning for something more, as the trio moves through a world of icy fields and creaking barns. Wharton’s tale unfolds with a somber grace, sketching a life shaped by hardship and the pull of unspoken desires.",
      "pageCount": 98,
      "publishedDate": "2024-05-30"
    },
    {
      "title": "Anna Karenina",
      "author": "Лев Толстой",
      "cover": "https://covers.openlibrary.org/b/id/2560652-L.jpg",
      "price": 316,
      "genre": "Realist Fiction",
      "id": 57,
      "sypnosis": "In the glittering salons of imperial Russia, Anna Karenina, a poised and striking woman, lives a polished life with her steady husband Alexei and their young son, until a chance meeting with the dashing Count Vronsky stirs her restless heart. Meanwhile, Konstantin Levin, a thoughtful landowner, seeks meaning in the fields and forests, his quiet courtship of Kitty weaving a counterpoint to Anna’s city world. Their stories unfold amid train stations, ballrooms, and rural estates, surrounded by a cast of aristocrats, peasants, and kin who reflect Russia’s shifting tides. Tolstoy’s vast narrative captures the pulse of love, duty, and the search for purpose in a society of splendor and strain.",
      "pageCount": 1270,
      "publishedDate": "2022-06-12"
    },
    {
      "title": "Jane Eyre",
      "author": "Charlotte Brontë",
      "cover": "https://covers.openlibrary.org/b/id/8235363-L.jpg",
      "price": 144,
      "genre": "Gothic Fiction",
      "id": 58,
      "sypnosis": "Jane Eyre, a plain but spirited orphan, endures a harsh childhood under a cruel aunt and a bleak school, emerging with a fierce will to carve her own path in Victorian England. Hired as a governess at Thornfield Hall, she tends to the bright young Adele and meets Mr. Rochester, the estate’s brooding master, whose sharp wit and hidden depths draw her in. The mansion’s shadowy corridors and strange sounds hint at secrets, while Jane navigates her place among its servants and visitors, from the kind Mrs. Fairfax to the elegant Blanche Ingram. Brontë’s gothic romance unfolds with strength and mystery, tracing a woman’s quest for love and independence in a world of stone and storm.",
      "pageCount": "300",
      "publishedDate": "2024-11-22"
    },
    {
      "title": "Le Comte de Monte Cristo",
      "author": "Alexandre Dumas",
      "cover": "https://covers.openlibrary.org/b/id/14566393-L.jpg",
      "price": 261,
      "genre": "Adventure",
      "id": 59,
      "sypnosis": "Edmond Dantès, a young sailor with a bright future, stands on the cusp of happiness in Marseille, engaged to the lovely Mercédès, when jealousy and betrayal land him in the grim cells of the Château d’If. Imprisoned without trial, he meets a fellow captive, the wise Abbé Faria, whose tales and teachings fuel Edmond’s dreams of freedom and a hidden treasure. Years later, he emerges into the world anew, cloaked in wealth and mystery as the Count of Monte Cristo, moving through Paris and beyond with a keen eye on those who wronged him. Dumas’ epic swirls with adventure and intrigue, a grand journey through a man’s transformation and the shadows of justice.",
      "pageCount": 500,
      "publishedDate": "2002-07"
    },
    {
      "title": "Uncle Tom's Cabin",
      "author": "Harriet Beecher Stowe",
      "cover": "https://covers.openlibrary.org/b/id/12728198-L.jpg",
      "price": 488,
      "genre": "Historical Fiction",
      "id": 60,
      "sypnosis": "In the antebellum South, Uncle Tom, a steadfast enslaved man, lives on a Kentucky plantation with his family, his faith a quiet anchor amidst the cruelties of bondage. When debts force his sale, he’s torn from home, crossing paths with Eliza, a young mother fleeing with her child across icy rivers, and a cast of souls—kindly Quakers, harsh traders, and the gentle Eva St. Clare. Their stories weave through fields, cabins, and bustling towns, painting a raw picture of a nation divided by slavery’s weight. Stowe’s heartfelt tale shines with compassion and outrage, a cry against injustice wrapped in the lives of those who endure it.",
      "pageCount": 524,
      "publishedDate": "1901"
    },
    {
      "title": "Harry Potter and the Deathly Hallows",
      "author": "J. K. Rowling",
      "cover": "https://covers.openlibrary.org/b/id/10110415-L.jpg",
      "price": 332,
      "genre": "Fantasy",
      "id": 61,
      "sypnosis": "Harry Potter, now seventeen, leaves the safety of Hogwarts behind, joining Ron Weasley and Hermione Granger on a perilous quest across a wizarding world darkened by fear and loss. With a mission left by Dumbledore, they roam through misty woods, quiet villages, and hidden lairs, chasing clues tied to mysterious objects and an old tale of magical relics. Pursued by shadowy forces and tested by doubts, the trio leans on their bond, meeting allies like the quirky Lovegoods and foes who wield power with a ruthless hand. Rowling’s final chapter unfolds with magic and heart, a journey through a realm teetering on the edge of hope and shadow.",
      "pageCount": 769,
      "publishedDate": "2015-12-08"
    },
    {
      "title": "Tarzan the Invincible (Ace Classic SF, F-189)",
      "author": "Edgar Rice Burroughs",
      "cover": "https://covers.openlibrary.org/b/id/284443-L.jpg",
      "price": 322,
      "genre": "Adventure",
      "id": 62,
      "sypnosis": "Tarzan, the jungle-raised lord of Africa’s wilds, swings through dense canopies and roaring rivers, his keen senses attuned to the land he calls home, when outsiders—cold and calculating—encroach with plans that threaten his domain. Led by a determined woman and her crew, they bring machines and motives that clash with the jungle’s untamed pulse, drawing Tarzan into a contest of strength and wits. Allies like his ape kin and foes from distant lands fill the steamy air with tension, as he moves through vine and shadow with a primal grace. Burroughs’ pulpy tale roars with action and the call of the wild, a clash of worlds under a blazing sun.",
      "pageCount": 512,
      "publishedDate": "1998-10-13"
    },
    {
      "title": "Les cigares du pharaon",
      "author": "Hergé",
      "cover": "https://covers.openlibrary.org/b/id/3325898-L.jpg",
      "price": 432,
      "genre": "Graphic Novel",
      "id": 63,
      "sypnosis": "Tintin, a plucky young reporter with a shock of hair, boards a ship with his loyal dog Snowy, bound for adventure, only to stumble into a riddle tied to an Egyptian tomb and a strange symbol etched in sand. His trail leads from dusty pyramids to bustling ports, then deep into India’s jungles, where smugglers, fakirs, and shadowy figures weave a web of danger around him. With his knack for trouble and a nose for truth, Tintin dodges traps and unravels clues, joined by bumbling detectives Thomson and Thompson, whose antics add a dash of chaos. Hergé’s vivid tale leaps with humor and peril, a global chase drawn in crisp, bold lines.",
      "pageCount": 80,
      "publishedDate": "2013"
    },
    {
      "title": "Ready Player One",
      "author": "Ernest Cline",
      "cover": "https://covers.openlibrary.org/b/id/8737626-L.jpg",
      "price": 421,
      "genre": "Science Fiction",
      "id": 64,
      "sypnosis": "In a gritty 2045, where the real world crumbles, Wade Watts escapes into the OASIS, a sprawling virtual universe of neon-lit quests and retro games, crafted by the late genius James Halliday. When Halliday’s death sparks a contest to find a hidden prize within this digital realm, Wade—under his avatar Parzival—dives in, joined by a crew of misfits like Art3mis and Aech, each chasing a dream amid pixelated wonders. They face rivals, from lone players to a ruthless corporation, in a race through 1980s trivia, arcade battles, and virtual cities glowing with possibility. Cline’s tale buzzes with nostalgia and high stakes, a blend of tech and heart in a future tethered to the past.",
      "pageCount": 386,
      "publishedDate": "2011-08-16"
    },
    {
      "title": "Into the Wild",
      "author": "Erin Hunter",
      "cover": "https://covers.openlibrary.org/b/id/12720669-L.jpg",
      "price": 533,
      "genre": "Adventure",
      "id": 65,
      "sypnosis": "Rusty, a curious housecat with a restless spirit, leaves his cushy life to join ThunderClan, one of four feline tribes ruling a forest alive with secrets, becoming Firepaw under the watchful eye of leader Bluestar. Amid towering oaks and rustling ferns, he learns the ways of the wild—hunting, fighting, and honoring the warrior code—while meeting clanmates like the fierce Tigerclaw and the gentle Graypaw. Tensions simmer with rival clans like ShadowClan, their borders marked by scent and claw, pulling Firepaw into a world of loyalty and lurking threats. Hunter’s tale purrs with the thrill of discovery, a young cat’s leap into a realm of fur and fang.",
      "pageCount": 226,
      "publishedDate": "2023-04-17"
    },
    {
      "title": "The Honor of the Big Snows",
      "author": "James Oliver Curwood",
      "cover": "https://covers.openlibrary.org/b/id/5820824-L.jpg",
      "price": 428,
      "genre": "Adventure",
      "id": 66,
      "sypnosis": "In the frozen reaches of Canada’s north, where snow blankets pines and rivers freeze, a rugged soul—perhaps a trapper or trader—faces the wild with a heart tied to honor and the land’s stark beauty. Surrounded by howling winds and the glow of a cabin fire, he moves through a world of fur-clad folk, loyal dogs, and the ever-present call of survival, where trust is hard-won and danger lurks in the frost. Curwood’s story unfolds with the crunch of snow underfoot and the whisper of a tale shaped by the wilderness, a rugged dance of grit and grace against nature’s might. It’s a journey through icy trails, rich with the spirit of a frontier untamed.",
      "pageCount": 269,
      "publishedDate": "2023-03-29"
    },
    {
      "title": "The Sword of Summer",
      "author": "Rick Riordan",
      "cover": "https://covers.openlibrary.org/b/id/13012106-L.jpg",
      "price": 230,
      "genre": "Fantasy",
      "id": 67,
      "sypnosis": "Magnus Chase, a scrappy Boston teen scraping by on the streets, discovers he’s tied to Norse gods when a fiery encounter lands him in Valhalla, a hall of warriors ruled by Odin’s stern gaze. With a magical sword and a destiny he didn’t ask for, he teams with a quirky crew—a fierce Valkyrie, a stylish elf, and a gruff dwarf—to face a world of trolls, giants, and Loki’s sly whispers across the Nine Realms. From city rooftops to misty shores, Magnus stumbles through myths and mischief, his wit as sharp as his blade. Riordan’s tale crackles with humor and myth, a wild ride through a modern saga of gods and guts.",
      "pageCount": "300",
      "publishedDate": "2017-04-04"
    },
    {
      "title": "Ghost Ship",
      "author": "Clive Cussler",
      "cover": "https://covers.openlibrary.org/b/id/7278086-L.jpg",
      "price": 115,
      "genre": "Adventure",
      "id": 68,
      "sypnosis": "Kurt Austin, a daring operative for NUMA, dives into the seas’ depths when a luxury liner vanishes, its fate a puzzle tied to whispers of a high-stakes scheme lurking beneath the waves. With his trusty team—including the quick-thinking Joe Zavala—he sails through sunlit waters and shadowed wrecks, facing foes who wield tech and treachery with equal skill. From ocean swells to hidden ports, their hunt unfolds with gadgets, guts, and the salty tang of adventure, chasing a mystery that ripples far beyond the horizon. Cussler’s thriller surges with action and the pull of the unknown, a nautical chase in a world of sunken secrets.",
      "pageCount": "300",
      "publishedDate": "2025-04-10"
    },
    {
      "title": "Floodtide",
      "author": "Frank Yerby",
      "cover": "https://covers.openlibrary.org/b/id/9362782-L.jpg",
      "price": 499,
      "genre": "Historical Fiction",
      "id": 69,
      "sypnosis": "In the sultry air of antebellum South Carolina, a young man rises from humble roots into a world of sprawling plantations and whispered tensions, his path shaped by ambition and the tides of a changing South. Surrounded by cotton fields, grand houses, and a cast of planters, belles, and restless souls, he navigates a society rich with beauty and shadowed by its own divides. Love and rivalry weave through his days, set against a land where history hums beneath the surface, poised for upheaval. Yerby’s tale flows with drama and the weight of an era, a vivid glimpse into a man’s climb amid the floodtide of time.",
      "pageCount": 374,
      "publishedDate": "1901"
    },
    {
      "title": "Toll the Hounds",
      "author": "Steven Erikson",
      "cover": "https://covers.openlibrary.org/b/id/6684006-L.jpg",
      "price": 553,
      "genre": "Fantasy",
      "id": 70,
      "sypnosis": "In the sprawling Malazan world, the city of Darujhistan glimmers with torchlight and intrigue, its streets alive with merchants, thieves, and the looming presence of gods who play their own games. Anomander Rake, a dark and ancient lord, watches over his people, while figures like the sly Kruppe and the towering Karsa Orlong move through a tapestry of schemes and shadows. The Hounds of Shadow stir, their howls a distant echo, as the city braces for forces both mortal and divine that gather on its edges. Erikson’s epic unfurls with a dense, poetic sweep, a realm where fate and defiance clash under a sky heavy with portent.",
      "pageCount": 228,
      "publishedDate": "2008"
    },
    {
      "title": "The Government Inspector",
      "author": "Nikolai Galov",
      "price": "205",
      "cover":"",
      "sypnosis":"In a small Russian town, a series of absurd misunderstandings unfolds as a low-ranking official, mistaken for a high-ranking government inspector, is showered with bribes and hospitality by the town's corrupt officials. As the impostor, Anton Antonovich Khlestakov, revels in his newfound power and influence, he exposes the hypocrisy and corruption of the town's leaders, leading to a series of comedic and chaotic events. Through biting satire and social commentary, Gogol critiques the bureaucratic excesses and moral decay of 19th-century Russia, exposing the absurdity of a system where appearances often triumph over reality.",
      "id": 71,
      "pageCount": 161,
      "publishedDate": "2016-05-23"
    }
  ]
}