{
  "users": [
    { "username": "Admin", "password": "12345", "id": 0 },
    {
      "username": "Perry",
      "password": "12345",
      "id": 2,
      "savedBooks": [
        {
          "title": "Frankenstein or The Modern Prometheus",
          "author": "Mary Shelley",
          "cover": "https://covers.openlibrary.org/b/id/12356249-L.jpg",
          "price": 334,
          "genre": "Gothic Fiction",
          "id": 9,
          "sypnosis": ""
        },
        {
          "title": "The Man Who Was Thursday",
          "author": "Gilbert Keith Chesterton",
          "cover": "https://covers.openlibrary.org/b/id/8242857-L.jpg",
          "price": 495,
          "genre": "Mystery",
          "id": 18,
          "sypnosis": ""
        },
        {
          "title": "The Secret Adversary",
          "author": "Agatha Christie",
          "cover": "https://covers.openlibrary.org/b/id/14590159-L.jpg",
          "price": 283,
          "genre": "Mystery",
          "id": 14,
          "sypnosis": "I"
        }
      ],
      "readingHistory": ["18", "14"],
      "readingGoal": {
        "inProgress": true,
        "targetNumberOfBooks": "2",
        "deadline": "2025-4-17",
        "readBooks": [
          {
            "title": "Frankenstein or The Modern Prometheus",
            "author": "Mary Shelley",
            "cover": "https://covers.openlibrary.org/b/id/12356249-L.jpg",
            "price": 334,
            "genre": "Gothic Fiction",
            "id": 9,
            "sypnosis": "",
            "pageCount": 220,
            "publishedDate": "1846",
            "readingHistory": [
              { "date": "2025-04-23T12:11:56.610Z", "pagesRead": 219 }
            ],
            "currentPage": "220"
          }
        ],
        "duration": "1",
        "durationUnit": "week",
        "goalName": "novelTarget",
        "startDate": "2025-04-16T14:31:16.797Z",
        "readingHours": "2"
      },
      "currentlyReading": [
        {
          "title": "The Man Who Was Thursday",
          "author": "Gilbert Keith Chesterton",
          "cover": "https://covers.openlibrary.org/b/id/8242857-L.jpg",
          "price": 495,
          "genre": "Mystery",
          "id": "18",
          "sypnosis": "",
          "pageCount": 165,
          "publishedDate": "2015-04-28",
          "readingHistory": [
            { "date": "2025-04-15T15:42:56.193Z", "pagesRead": 9 },
            { "date": "2025-04-16T12:01:17.387Z", "pagesRead": 10 }
          ],
          "currentPage": "20"
        }
      ],
      "studyGoal": {
        "active": true,
        "subTopics": [
          { "topicName": "Forces", "studied": false, "id": 0 },
          { "topicName": "Work, Energy and Power ", "studied": false, "id": 1 },
          { "topicName": "Introduction", "studied": false, "id": 2 }
        ],
        "duration": "1",
        "durationUnit": "weeks",
        "startDate": "2025-04-25T14:28:41.037Z"
      }
    },
    {
      "username": "Larry",
      "password": "12345",
      "id": 3,
      "currentBooks": [],
      "savedBooks": [
        {
          "title": "Pride and Prejudice",
          "author": "Jane Austen",
          "cover": "https://covers.openlibrary.org/b/id/14348537-L.jpg",
          "price": 229,
          "genre": "Romance",
          "id": 1,
          "sypnosis": "In the rolling countryside of Regency England, Elizabeth Bennet, a sharp-witted young woman, lives with her four sisters and fretful mother, who is eager to secure them all advantageous marriages due to their modest circumstances. The arrival of the charming Mr. Bingley and his reserved friend Mr. Darcy at nearby Netherfield Park stirs the small community, setting off a flurry of balls, visits, and whispered speculations. Elizabeth finds herself at odds with Darcy’s aloof demeanor, sparking a lively clash of personalities that draws them into a web of misunderstandings and unspoken tensions. Alongside her family’s quirks—her father’s dry humor, her mother’s matchmaking zeal, and her sisters’ varied pursuits—the story unfolds with a cast of colorful figures like the pompous Mr. Collins and the dashing yet dubious Mr. Wickham, all navigating the delicate dance of love, pride, and social expectation in Austen’s witty exploration of human connection."
        },
        {
          "title": "Alice's Adventures in Wonderland",
          "author": "Lewis Carroll",
          "cover": "https://covers.openlibrary.org/b/id/10527843-L.jpg",
          "price": 589,
          "genre": "Fantasy",
          "id": 2,
          "sypnosis": "On a lazy summer afternoon, curious Alice spots a White Rabbit in a waistcoat, hurrying along with a pocket watch and muttering about being late, prompting her to follow him down a peculiar rabbit hole. She tumbles into Wonderland, a strange and whimsical land where she encounters a host of eccentric characters: a grinning Cheshire Cat, a Mad Hatter hosting an endless tea party, and a hot-tempered Queen of Hearts fond of croquet and commands. As Alice navigates this topsy-turvy world—shrinking and growing with mysterious potions and cakes—she faces absurd situations, from debating a philosophical Caterpillar to joining a game with flamingos as mallets. Carroll’s fantastical tale brims with playful riddles and surreal encounters, inviting readers into a dreamlike realm where the rules of reality bend and a young girl’s curiosity leads her through a maze of wonder and oddity."
        },
        {
          "title": "Vingt mille lieues sous les mers",
          "author": "Jules Verne",
          "cover": "https://covers.openlibrary.org/b/id/6573517-L.jpg",
          "price": 108,
          "genre": "Science Fiction",
          "id": 47,
          "sypnosis": "Professor Pierre Aronnax, a French marine scholar, sets sail to investigate a mysterious ‘narwhal’ plaguing the seas, joined by his steadfast servant Conseil and the rugged harpooner Ned Land, only to find themselves aboard the Nautilus, a marvel of a submarine. Its commander, the enigmatic Captain Nemo, reveals a world beneath the waves, from coral gardens to sunken wrecks, all seen through the vessel’s glass ports as they glide through ocean depths. Aronnax marvels at the science and secrecy of Nemo’s domain, while Ned chafes at their confinement, their journey weaving through currents and wonders that defy the surface world. Verne’s vision dives into a realm of discovery and tension, blending awe with the pull of freedom."
        },
        {
          "title": "The Picture of Dorian Gray",
          "author": "Oscar Wilde",
          "cover": "https://covers.openlibrary.org/b/id/14314858-L.jpg",
          "price": 518,
          "genre": "Gothic Fiction",
          "id": 36,
          "sypnosis": "Dorian Gray, a youthful beauty in Victorian London, captivates the artist Basil Hallward, who pours his soul into a portrait that glows with life, while the worldly Lord Henry Wotton whispers ideas of pleasure and youth into Dorian’s ear. Drawn into the glittering salons and dim theaters of the city, Dorian begins to chase a life of sensation, surrounded by admirers and the trappings of wealth, yet tethered to the painting that holds a secret he can’t ignore. As he moves through a society of strict codes and hidden vices, the contrast between his outward charm and inner choices begins to cast a shadow. Wilde’s gothic narrative glimmers with wit and unease, sketching a young man’s journey into a world where beauty and truth pull in opposite directions."
        }
      ],
      "readBooks": [],
      "readingGoal": {
        "targetNumberOfBooks": null,
        "deadline": null,
        "startDate": null,
        "readingHours": null,
        "currentBook": null,
        "readBooks": []
      }
    }
  ]
}
